Revit 2026 API

# RoomIsPointInRoom Method

---

Determines if a point lies within the volume of the room.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsPointInRoom(
	XYZ point
)
```
```vb
Public Function IsPointInRoom (
	point As XYZ
) As Boolean
```
```cpp
public:
bool IsPointInRoom(
	XYZ^ point
)
```
```fsharp
member IsPointInRoom :
        point : XYZ -> bool
```

#### Parameters

point XYZ
    Point to be checked.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the point is . |
| ArgumentException | The coordinates of the point is not a number. |

#### Reference

Room Class

Autodesk.Revit.DB.Architecture Namespace